app/controllers/casetitle_controller.rb

  def index
    @casetitle = Casetitle.all
---
SELECT "casetitles".* FROM "casetitles"