app/controllers/casetitles_controller.rb

SELECT "casetitles".* FROM "casetitles"
---
  def index
    @casetitles = Casetitle.all

SELECT  "casetitles".* FROM "casetitles" WHERE "casetitles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
     @casetitles = Casetitle.find(params[:id])

INSERT INTO "casetitles" ("title", "summary", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["summary", ""], ["created_at", 2016-12-26 11:41:21 UTC], ["updated_at", 2016-12-26 11:41:21 UTC]]
---
  def create
    @casetitle = Casetitle.new(casetitle_params)

    if @casetitle.save(casetitle_params)

SELECT  "casetitles".* FROM "casetitles" WHERE "casetitles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @casetitle = Casetitle.find(params[:id])

SELECT  "casetitles".* FROM "casetitles" WHERE "casetitles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "casetitles" SET "title" = ?, "summary" = ?, "updated_at" = ? WHERE "casetitles"."id" = ?  [["title", "q2"], ["summary", "q2"], ["updated_at", 2016-12-26 11:47:47 UTC], ["id", 2]]
---
  def update
    @casetitle = Casetitle.find(params[:id])

    if @casetitle.update(casetitle_params)

SELECT  "casetitles".* FROM "casetitles" WHERE "casetitles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "casetitles" WHERE "casetitles"."id" = ?  [["id", 1]]
---
  def destroy
    @casetitle = Casetitle.find(params[:id])
    @casetitle.destroy